libretiny-eu/libretiny/boards/generic-bk7231t-qfn32-tuya/variant.h
/* This file was auto-generated from generic-bk7231t-qfn32-tuya.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         19
#define NUM_DIGITAL_PINS   19
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 15u    // GPIO23
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 2
#define PIN_WIRE1_SCL         12u // GPIO20
#define PIN_WIRE1_SDA         13u // GPIO21
#define PIN_WIRE2_SCL         0u  // GPIO0
#define PIN_WIRE2_SDA         1u  // GPIO1

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 2
#define PIN_SERIAL1_RX          6u // GPIO10
#define PIN_SERIAL1_TX          7u // GPIO11
#define PIN_SERIAL2_RX          1u // GPIO1
#define PIN_SERIAL2_TX          0u // GPIO0

// Pin function macros
// -------------------
#define PIN_FUNCTION_ADC3 15u // GPIO23
#define PIN_FUNCTION_CS   9u  // GPIO15
#define PIN_FUNCTION_MISO 11u // GPIO17
#define PIN_FUNCTION_MOSI 10u // GPIO16
#define PIN_FUNCTION_P0   0u  // GPIO0
#define PIN_FUNCTION_P1   1u  // GPIO1
#define PIN_FUNCTION_P6   2u  // GPIO6
#define PIN_FUNCTION_P7   3u  // GPIO7
#define PIN_FUNCTION_P8   4u  // GPIO8
#define PIN_FUNCTION_P9   5u  // GPIO9
#define PIN_FUNCTION_P10  6u  // GPIO10
#define PIN_FUNCTION_P11  7u  // GPIO11
#define PIN_FUNCTION_P14  8u  // GPIO14
#define PIN_FUNCTION_P15  9u  // GPIO15
#define PIN_FUNCTION_P16  10u // GPIO16
#define PIN_FUNCTION_P17  11u // GPIO17
#define PIN_FUNCTION_P20  12u // GPIO20
#define PIN_FUNCTION_P21  13u // GPIO21
#define PIN_FUNCTION_P22  14u // GPIO22
#define PIN_FUNCTION_P23  15u // GPIO23
#define PIN_FUNCTION_P24  16u // GPIO24
#define PIN_FUNCTION_P26  17u // GPIO26
#define PIN_FUNCTION_P28  18u // GPIO28
#define PIN_FUNCTION_PWM0 2u  // GPIO6
#define PIN_FUNCTION_PWM1 3u  // GPIO7
#define PIN_FUNCTION_PWM2 4u  // GPIO8
#define PIN_FUNCTION_PWM3 5u  // GPIO9
#define PIN_FUNCTION_PWM4 16u // GPIO24
#define PIN_FUNCTION_PWM5 17u // GPIO26
#define PIN_FUNCTION_RX1  6u  // GPIO10
#define PIN_FUNCTION_RX2  1u  // GPIO1
#define PIN_FUNCTION_SCK  8u  // GPIO14
#define PIN_FUNCTION_SCL1 12u // GPIO20
#define PIN_FUNCTION_SCL2 0u  // GPIO0
#define PIN_FUNCTION_SDA1 13u // GPIO21
#define PIN_FUNCTION_SDA2 1u  // GPIO1
#define PIN_FUNCTION_TX1  7u  // GPIO11
#define PIN_FUNCTION_TX2  0u  // GPIO0
